Repository: SourceCodeDB/SourceCodeDB
Catalog: locale/*/LC_MESSAGES/*.po
Languages: sv_se

source: We are SourceCodeDB.com!
sv_se: Vi är SourceCodeDB.com!

source: We are a group of students att Mälardalens University in Västerås, Sweden and we made this as our first project in our introduction course to computer science.
sv_se: Vi är en grupp studenter från Mälardalens högskola i Västerås, Sverige och den här sidan har vi gjort som vårt första projekt i vår introduktions kurs.

source: Most of us in the group are completely new to web based programming and have had to learn a lot of information in a very short period of time. The codeing languages we have had to learn to make this site inlcude PHP, HTML, Javascript, jQuery, and AJAX. We hope you enjoy our site and if you have any tips or ideas feel free to contact us via our
sv_se: De flesta av oss i gruppen är helt nya inom webbutveckling och har därför behövt lära oss väldigt mycket på en kort tid. Programspråken som vi har behövt lära oss är bland annat PHP, HTML, Javascript, CSS men även teknikerna bakom AJAX och jQuery. Vi hoppas att du kommer att uppskatta vår sida och om du har några tips eller ideér hur vi kan förbättra sidan via våran

source: contact us
sv_se: kontakta oss

source: page.
sv_se: sida.

source: Here you may upload code, please make sure your code is right and that you dont abuse our site. We take our code and users who abuse our site very seriously. Thank you for making SourceCodeDB.com better!
sv_se: Här kan du ladda upp kod, var god kontrollera om koden är rätt innan du laddar upp koden. Tack för att du hjälper SourceCodeDB.com!

source: Title
sv_se: Titel

source: Please enter a descriptive title
sv_se: Var god skriv in en tydlig titel för koden

source: Description
sv_se: Beskrivning

source: Please enter description that will help users understand what the code does.
sv_se: Skriv en utförlig beskrivning på vad koden gör.

source: Enter your code!
sv_se: Skriv in din kod!

source: Source
sv_se: Källa

source: Leave blank if code is yours or there is no source but if you have taken this code from another website please tell us your source so that credit can be given.
sv_se: Lämna rutan blank om koden är din. Om du dock har tagit koden från en webplats eller bok bör du skriva vart du har hittat koden.

source: Share on facebook?
sv_se: Dela med dig på facebook?

source: Language
sv_se: Språk

source: Difficulty
sv_se: Nivå

source: Category
sv_se: Kategori

source: sorry you must be logged in to post
sv_se: Du måste vara inloggad för att kommentera

source: Could not find a username matching your query
sv_se: Kunde inte hitta ett användarnamn som matchar din fråga

source: Site Statistics
sv_se: Hemsidans statistik

source: Bookmarks
sv_se: Bokmärken

source: Public codes
sv_se: Allmäna koder

source: Private codes
sv_se: Privata koder

source: Comments
sv_se: Kommentarer

source: Remove all
sv_se: Ta bort alla

source: Avatars
sv_se: Avatarer

source: Codes
sv_se: Koder

source: Ratings
sv_se: Betyg

source: News
sv_se: Nyheter

source: Rankings
sv_se: Betyg

source: Everything
sv_se: Allt

source: that belongs to no user
sv_se: den tillhör ingen användare

source: Site log
sv_se: Hemsidans logg

source: Warn
sv_se: Varning

source: Action
sv_se: Handling

source: Time
sv_se: Tid

source: Code
sv_se: Kod

source: Comment section
sv_se: Kommentarsektion

source: Needs to be moderated
sv_se: Behöver bli modererad

source: User
sv_se: Användare

source: Warnings
sv_se: Varningar

source: Sorry you need to be an admin to access this page
sv_se: Enbart admins kan komma åt den här sidan

source: Registration required!
sv_se: Registrering krävs!

source: Ban sent!
sv_se: Ban skickad!

source: You cant ban yourself?
sv_se: Du kan inte banna dig själv?

source: Reason for ban:
sv_se: Orsaken till ban:

source: You dont have permission to ban users
sv_se: Du har inte tillräckligt med rättigheter för att banna användare

source: Sorry you must be logged in to ban users.
sv_se: Du måste vara inloggad för att banna användare.

source: You have been banned!
sv_se: Du har blivit bannad!

source: This could be because of spamming, abuse to our site, or many other reasons. Please read below.
sv_se: Det kan bero på spam eller många andra orsaker. Läs nedan

source: Reason
sv_se: Anledning

source: Date
sv_se: Datum

source: If you feel that this ban has occured as an error please contact us at
sv_se: Om du har blivit bannad utan orsak, kontakta oss här

source: You have been registered and your other SourceCodeDB.com account has been merged with this one.
sv_se: Du har nu blivit registrerad och ditt andra SourceCodeDB.com konto har blivit sammansatt med det här

source: Your facebook account has been added
sv_se: Ditt facebook konto har raderats

source: Please
sv_se: Var god

source: login.
sv_se: logga in.

source: You are not logged in?
sv_se: Du har inte loggat in

source: Contact Us
sv_se: Kontakta oss

source: Email us at contact@sourcecodedb.com
sv_se: Maila oss här contact@sourcecodedb.com

source: You can only post a comment every 30 seconds
sv_se: Man kan bara posta en komment var 30onde sekund

source: Comment submitted!
sv_se: Kommentar skickad!

source: Comment deleted!
sv_se: Kommentar borttagen!

source: Bookmark deleted!
sv_se: Bokmärket har tagits bort!

source: Bookmark saved!
sv_se: Bokmärket har sparats!

source: Code Deleted
sv_se: Kod borttagen

source: Author
sv_se: Skapare

source: Last Edited
sv_se: senast ändrad

source: Are you sure you want to delete this code?
sv_se: Är du säker på att du vill ta bort den här koden?

source: COMMENTS
sv_se: KOMMENTARER

source: Comment
sv_se: Kommentar

source: You must be logged in to comment
sv_se: Du måste logga in för att kommentera

source: something is wrong
sv_se: något är fel

source: Code not published
sv_se: Koden har inte publicerats

source: This code is no longer here
sv_se: Koden har tagits bort eller så existerar den inte

source: sorry you must be logged in to do that
sv_se: du måste vara inloggad för att göra det där

source: About us
sv_se: Om oss

source: Terms of Service
sv_se: Vilkor

source: Privacy Policy
sv_se: sekretesspolicy

source: source, code, database, sourcecode db, open source, library, php, java, javascript, c sharp, objective c, html, css, ASP, c++
sv_se: källa, kod, databas, källkod db, öppen källkod, bibliotek, php, java, javascript, c sharp, objective c, html, css, ASP, c++

source: SourceCodeDB is a place for all programmers, beginners and experts, to find and share useful source code on the net. All content on this site is free to use for everyone.
sv_se: SourceCodeDB är en plats för alla programmerare, nybörjare och experter, för att hitta och dela med sig utav användbar källkod. Allt på sidan är gratis för alla att använda.

source: Home
sv_se: Hem

source: Top Users
sv_se: Top användare

source: My Profile
sv_se: Mina sidor

source: Upload code
sv_se: Ladda upp kod

source: Requests
sv_se: Förslag

source: Register
sv_se: Registrera

source: Active login
sv_se: Aktiv login

source: logged in with Facebook
sv_se: Inloggad med Facebook

source: Already a member?
sv_se: Är du redan medlem?

source: Username
sv_se: Användarnamn

source: Password
sv_se: Lösenord

source: Not a member?
sv_se: Är du inte medlem?

source: now!
sv_se: nu!

source: Sign in
sv_se: Logga in

source: Or log in with Facebook
sv_se: Eller logga in med Facebook

source: Search
sv_se: Sök

source: Upload Code
sv_se: Ladda upp kod

source: All
sv_se: Alla

source: Other
sv_se: Annat

source: Welcome to SourceCodeDB.com!
sv_se: Välkommen till SourceCodeDB.com

source: SourceCodeDB is a place for all programmers, beginners and experts, to find and share useful code on the net. All content on this site is free to use for everyone.
sv_se: SourceCodeDB är en plats för alla programmerare, nybörjare, experter, för att hitta och dela med sig utav användbar källkod. Allt på sidan är gratis att använda för alla.

source: To search our database you dont have to be registered
sv_se: För att söka i vår databas behövs ingen registrering

source: Why register?
sv_se: Varför ska jag registrera mig?

source: As a registered user of SourceCodeDB you not only get the chance to upload your own code but you are also able to access My Profile where you can save codes you would like to use at a later point in time. You will also be able to comment on code, rate code, ask questions, and edit code. When uploading a code you can choose between publishing and saving it, in which while its published everyone can see it and while its saved the code is only visable for yourself.
sv_se: Som registrerad användare på SourceCodeDB kan man inte bara ladda upp sin egen kod, man får även tillgång till "Mina sidor" där man kan spara andra användares koder. Man kan även kommentera på kod, betygsätta andras koder och dessutom edita din egen kod. När man ska ladda upp sin egen kod får man två val. Antingen kan man spara koden så den enbart visas för dig vilket gör att du kan komma åt dina koder på alla dina datorer. Om man dock väljer att publisera koden så kommer du att dela med dig av din kod. Detta gör att din kod automatiskt kommer att visas i filtret när andra användare söker efter kod.

source: For
sv_se: För

source: new
sv_se: nya

source: users of SourceCodeDB you can read about how to use the site
sv_se: användare på SourceCodeDB kan läsa mer om hur man använder sidan fullt ut.

source: here.
sv_se: här.

source: This is a step to step guide on how to use SourceCodeDB
sv_se: Det här är en steg för steg guide hur man använder SourceCodeDB

source: Start by registering to the website. That gives you access to
sv_se: Starta med att registrera dig på sidan. Detta gör att du får tillgång till

source: My pages
sv_se: Mina sidor

source: You will find the register link in the top left hand side of the page.
sv_se: Registreringslänken finner du högst upp till vänster av sidan.

source: Sign in is also found in the top right.
sv_se: Login knappen finner du även högst upp till höger

source: Press the language you would like to see code for. You can select more than just one at a time.
sv_se: Tryck på det programspråket som du söker efter. Notera att det här är ett filter vilket gör att du kan trycka på fler programspråk åt gången

source: The difficulty filter is alredy activated, so if you would like to see just one press the one you
sv_se: Svårighetsgraderna lätt och svår är redan iklickade från början, tryck på den svårighetsgraden du

source: dont
sv_se: inte

source: want to see.
sv_se: vill se.

source: Click the title of the code you would like to see.
sv_se: Klicka på titeln av koden som du vill se

source: And there is the code.
sv_se: Och där finner du koden.

source: Now all thats left is to get started! Welcome to SourceCodeDB!
sv_se: Det ända som nu återstår nu är att köra igång! Välkommen till SourceCodeDB!

source: Latest news
sv_se: Senaste nyheter

source: and now you have been logged in with facebook
sv_se: och nu har du blivit inloggad med facebook

source: You dont seem to have a username specified, please type in a new name.
sv_se: Det verkar som du inte har laggt in ett användarnamn, var god skriva in ett nytt användarnamn.

source: Submit
sv_se: Skicka

source: Your facebook username matches another user in our database, please type a new name.
sv_se: Ditt facebooknamn finns redan i vår databas, var god välj ett nytt.

source: your facebook username is too short, please contact an administrator
sv_se: ditt facebooknamn är för kort, var god kontakta en administratör

source: your facebook username is too long, please contact an administrator
sv_se: Ditt facebooknamn är för långt, var god kontakta en administratör

source: mm, yea, not gonna happen
sv_se: Ja, fast ne. kommer inte att ske!

source: your facebook username can only contain alphabetical characters, please contact an administrator
sv_se: Ditt facebooknamn kan endast innehålla alfabetiska tecken, var god kontakta en administratör

source: You have been registered using facebook, please wait while we log you in!
sv_se: Du har nu registrerat dig genom facebook, var god vänta medans du automatiskt loggas in!

source: You seem to have gotten to this page by mistake
sv_se: Det verkar som att du har kommit till den här sidan av ett misstag

source: Join date
sv_se: Registrerings datum

source: Email address
sv_se: Email adress

source: First name
sv_se: Namn

source: Last name
sv_se: Efternamn

source: Add facebook
sv_se: Lägg till facebook

source: here
sv_se: här

source: Change password
sv_se: Ändra lösenord

source: Change email
sv_se: Ändra email

source: Messages
sv_se: Meddelanden

source: Message
sv_se: Meddelande

source: Create News
sv_se: Skapa nyhet

source: Send Message
sv_se: Skicka meddelande

source: Top Ranked
sv_se: Top Rankad

source: Top Rated
sv_se: Top betygsatta

source: Rating
sv_se: Betyg

source: name too short
sv_se: namnet är för kort

source: name too long
sv_se: namnet är för långt

source: Only alphabetical characters in name plz.
sv_se: Var god skriv in enbart alfabetiskta tecken.

source: last name too short
sv_se: efternamnet för för kort

source: last name too long
sv_se: efternamnet är för långt

source: Only alphabetical characters in last name plz.
sv_se: Skriv in endast alfabetiska tecken i efternamnet

source: email is wrong :)
sv_se: Emailen är felaktig

source: Username Unavailable
sv_se: Användarnamnet finns redan i databasen

source: username too short
sv_se: Användarnamnet är för kort

source: username too Long :)
sv_se: Användarnamnet är för långt

source: Only alphabetical characters in username plz.
sv_se: Skriv in endast alfabetiska tecken i användarnamnet.

source: password too short
sv_se: Lösenordet är för kort

source: Dude your password should not be that long :) Thats ridiculous!
sv_se: Ledsen men ditt lösenord är för långt!

source: Your passwords do not match buddy, might want to check that.
sv_se: Dina lösenord matchar inte varandra.

source: You have been registered! An email with your username and other info will be sent to you.
sv_se: Du har nu registerat dig! Ett mail kommer att skickas till dig med ditt användarnamn och annan viktig information.

source: First Name
sv_se: Namn

source: Last Name
sv_se: Efternamn

source: Again
sv_se: Igen

source: Reset
sv_se: Återställ alla fält

source: umm, you are already registered and should not need to register again?
sv_se: Du borde väll inte behöva registrera dig när du redan har ett konto?

source: Sorry your title is too long
sv_se: Titeln är tyvärr för lång

source: Sorry your title is too short
sv_se: Titeln är tyvärr för kort

source: Sorry you used less than 50 words
sv_se: tyvärr använde du färre än 50 ord

source: Sorry you cant use more than 3000 words
sv_se: Ledsen men du kan max använda 3000 ord

source: You can only send a request every 15 minutes
sv_se: Du kan endast skicka in ett förslag var 15onde minut

source: Request Submitted Successfully, we will now review and hopefully approve your request.
sv_se: Förslaget har skickats in! Admins kommer nu kolla igenom förslaget och förhoppningsvis godkänna ditt förslag.

source: Here you can make detailed requests that other users can get ideas from and hopefully share here on SourceCodeDB.com
sv_se: Här kan du skriva ett detaljerat förslag som andra användare kan ta del utav och förhoppningsvis dela med sig av detta på SourceCodeDB.com

source: For a request to be approved it must follow some guidelines.
sv_se: För att få sitt förslag godkänt måste några grundläggande regler följas.

source: Do research to see if there are other examples already out there
sv_se: Kontrollera så att det exemplet som du söker efter inte redan finns i databasen

source: Why should someone make this, how is it useful?
sv_se: Varför borde någon göra detta? Hur är det användbart?

source: Give some details on how it could be used
sv_se: Ge oss några detaljer kring hur det kan användas.

source: Could it be based of of something that already exists?
sv_se: Är det baserat på något som redan finns?

source: Your request should be around 200 to 500 words and be fairly thought out, we want to make this a useful brainstorming tool for developers.
sv_se: Ditt förslag ska vara mellan 200 och 500 ord och utförligt skrivet, vi vill att förslagsidan ska vara ett bra ställe som utvecklare kan få idéer ifrån!

source: Title: (50 char maximum)
sv_se: Titel: (50 tecken max)

source: Request
sv_se: Förslag

source: Submit Request
sv_se: Skicka in förslag

source: Sorry you must be logged in to see and use the request features.
sv_se: Var god logga in för att kunna se förslag

source: Latest uploads
sv_se: Senaste uppladdningarna

source: Please wait 30 seconds between messages
sv_se: Var god vänta 30 sekunder mellan varje skickat meddelande

source: Message sent!
sv_se: Meddelenade skickat!

source: You cant send yourself a message
sv_se: Du kan inte skicka meddelande till dig själv

source: Send To
sv_se: Skicka till

source: Send
sv_se: Skicka

source: You dont have permission to view this message
sv_se: Du har inte tillräckligt med rättigheter för att kolla på det här meddelandet

source: Sorry you must be logged in to see your messages.
sv_se: Var god logga in för att kunna titta på dina meddelanden

source: Sent
sv_se: Skickat

source: By
sv_se: Av

source: Reply to message
sv_se: Svara på meddelande

source: Please enter valid URL including http://
sv_se: Var god skriv in en giltig URL med http://

source: Title cant be that long
sv_se: Titeln kan inte vara så lång

source: Title cant be that short
sv_se: Titeln kan inte vara så kort

source: Code Submitted!
sv_se: Koden har nu skickats in!

source: Sorry you must be logged in to do that
sv_se: Ledsen, men du behöver vara inloggad för att göra detta

source: Code updated
sv_se: Koden har nu uppdaterats

source: Approved
sv_se: Godkänd

source: Yes
sv_se: Ja

source: No
sv_se: Nej

source: The Request
sv_se: Förslaget

source: This comment is approved
sv_se: Den här kommentaren har blivit godkänd

source: Request not approved
sv_se: Förslaget har inte blivit godkänt

source: Please wait 5 seconds between warnings
sv_se: Var god vänta 5 sekunder mellan varningarna

source: Warning sent!
sv_se: Varning skickad!

source: Reason for warning
sv_se: Anledning till varningen

source: Wrong email!
sv_se: Fel email

source: Too short!
sv_se: för kort

source: Password max length is 30 chracters
sv_se: Lösenordets maxlängd är 30 tecken

source: Your passwords do not match!
sv_se: Dina lösenord matchar inte varandra

source: Wrong password!
sv_se: Fel lösenord!

source: No server specified
sv_se: Ingen server har valts

source: Error
sv_se: Fel

source: no login ID submitted
sv_se: inget login ID har skickats

source: connection not established
sv_se: Ingen communication har etablerats

source: No password submitted
sv_se: Inget lösenord har skickats in

source: Authentication failed
sv_se: autentiseringen misslyckades

source: No connection to server
sv_se: Ingen kommunication till servern

source: No login ID submitted
sv_se: inget login ID har skickats

source: No server banner
sv_se: Ingen server banner

source: abort
sv_se: avbryt

source: apop authentication failed
sv_se: apop autentiseringen misslyckades

source: Premature end of list
sv_se: Förtida slutet av listan

source: Empty command string
sv_se: Tom kommandosträng

source: connection does not exist
sv_se: anslutningen existerar inte

source: No msg number submitted
sv_se: inget meddelande nummer har skickats

source: Command failed
sv_se: kommandot misslyckades
